-- phpMyAdmin SQL Dump
-- version 4.9.2
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Ноя 09 2021 г., 10:08
-- Версия сервера: 5.7.36-0ubuntu0.18.04.1
-- Версия PHP: 7.3.29-1+ubuntu18.04.1+deb.sury.org+1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `DemoExam`
--

-- --------------------------------------------------------

--
-- Структура таблицы `Product`
--

CREATE TABLE `Product` (
  `ID` int(11) NOT NULL,
  `Title` varchar(100) CHARACTER SET utf8mb4 NOT NULL,
  `Cost` decimal(19,4) NOT NULL,
  `Description` longtext CHARACTER SET utf8mb4,
  `MainImagePath` varchar(1000) CHARACTER SET utf8mb4 DEFAULT NULL,
  `IsActive` tinyint(1) NOT NULL,
  `ManufacturerID` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `Product`
--

INSERT INTO `Product` (`ID`, `Title`, `Cost`, `Description`, `MainImagePath`, `IsActive`, `ManufacturerID`) VALUES
(1, 'Ирисовый освежающий увлажняющий крем', '720.0000', 'Описание отсутствует', 'Товары салона красоты\\1953276-1.jpg', 1, 33),
(2, 'Сыворотка для кожи вокруг глаз с гиалуроновой кислотой', '690.0000', 'Описание отсутствует', 'Товары салона красоты\\9631447-1.jpg', 1, 49),
(3, 'Тоник для лица дневной, Витаминный', '800.0000', 'Описание отсутствует', 'Товары салона красоты\\7293278-1.jpg', 1, 19),
(7, 'Увлажняющий крем', '730.0000', 'Описание отсутствует', 'Товары салона красоты\\1781678-1.jpg', 0, 33),
(8, 'Восстанавливающая маска для лица', '630.0000', 'Описание отсутствует', 'Товары салона красоты\\3432465-1.jpg', 0, 6),
(9, 'Крем SILK для чувствительной кожи лица натуральный', '740.0000', 'Описание отсутствует', 'Товары салона красоты\\9939701-1.jpg', 1, 10),
(10, 'Подарочный набор Сияние', '630.0000', 'Описание отсутствует', 'Товары салона красоты\\6964198-1.jpg', 1, 19),
(11, 'Пена для бритья Натуральная, Лимон и Корица', '470.0000', 'Описание отсутствует', 'Товары салона красоты\\7528034-1.jpg', 1, 19),
(12, 'Крем питательный тонизирующий ночной', '950.0000', 'Описание отсутствует', 'Товары салона красоты\\3388879-1.jpg', 1, 46),
(13, 'Подарочный набор Супер Увлажнение', '830.0000', 'Описание отсутствует', 'Товары салона красоты\\6964197-1.jpg', 1, 19),
(14, 'Подарочный набор Глубокое Очищение', '860.0000', 'Описание отсутствует', 'Товары салона красоты\\6964196-1.jpg', 1, 19),
(15, 'Тоник ACTIVE для возрастной кожи лица натуральный', '720.0000', 'Описание отсутствует', 'Товары салона красоты\\9939709-1.jpg', 1, 10),
(17, 'Увлажняющая эмульсия для лица', '910.0000', 'Описание отсутствует', 'Товары салона красоты\\6556463-1.jpg', 1, 50),
(18, 'Масло персиковое', '280.0000', 'Описание отсутствует', 'Товары салона красоты\\6691688-1.jpg', 1, 19),
(19, 'Очищающая коллекция Ночной восстанавливающий крем для лица', '570.0000', 'Описание отсутствует', 'Товары салона красоты\\3432453-1.jpg', 1, 6),
(20, 'Подарочный набор For HIM, Сильный мужчина', '900.0000', 'Описание отсутствует', 'Товары салона красоты\\7299377-1.jpg', 1, 19),
(21, 'Антивозрастная коллекция Освежающий тоник Цветочный', '940.0000', 'Описание отсутствует', 'Товары салона красоты\\3432442-1.jpg', 1, 6),
(22, 'Розовый разглаживающий увлажняющий крем', '890.0000', 'Описание отсутствует', 'Товары салона красоты\\1781679-1.jpg', 1, 33),
(23, 'Деликатный питательный крем', '890.0000', 'Описание отсутствует', 'Товары салона красоты\\1781676-1.jpg', 1, 33),
(24, 'Масло сладкого миндаля', '250.0000', 'Описание отсутствует', 'Товары салона красоты\\6691687-1.jpg', 1, 19),
(25, 'Эфирное масло жасмин', '610.0000', 'Описание отсутствует', 'Товары салона красоты\\7064330-1.jpg', 1, 19),
(26, 'Натуральная пенка для умывания, с ароматом розового дерева', '750.0000', 'Описание отсутствует', 'Товары салона красоты\\6953177-1.jpg', 0, 19),
(27, 'Тоник для лица, для сухой и нормальной кожи', '490.0000', 'Описание отсутствует', 'Товары салона красоты\\9631443-1.jpg', 1, 49),
(28, 'Эфирное масло лемонграсс', '380.0000', 'Описание отсутствует', 'Товары салона красоты\\7064323-1.jpg', 1, 19),
(29, 'Ирисовый освежающий ночной крем', '840.0000', 'Описание отсутствует', 'Товары салона красоты\\1781674-1.jpg', 1, 33),
(30, 'Деликатное очищающее молочко', '680.0000', 'Описание отсутствует', 'Товары салона красоты\\1781675-1.jpg', 1, 33),
(31, 'Эфирное масло корицы', '370.0000', 'Описание отсутствует', 'Товары салона красоты\\7064335-1.jpg', 1, 19),
(32, 'Очищающий гель для умывания', '720.0000', 'Описание отсутствует', 'Товары салона красоты\\7847906-1.jpg', 0, 33),
(33, 'Солнцезащитный лосьон для лица и тела', '830.0000', 'Описание отсутствует', 'Товары салона красоты\\6556469-1.jpg', 1, 50),
(34, 'Коллекция Кокосовая, Очищающая пенка для лица с экстрактами кактуса', '540.0000', 'Описание отсутствует', 'Товары салона красоты\\3472602-1.jpg', 1, 6),
(35, 'S.O.S. средство против локальных несовершенств кожи', '870.0000', 'Описание отсутствует', 'Товары салона красоты\\7847905-1.jpg', 1, 33),
(36, 'Коллекция Сияние, Очищающая крем-пенка Лимон Мейера', '750.0000', 'Описание отсутствует', 'Товары салона красоты\\3472591-1.jpg', 1, 6),
(37, 'Подарочный набор Сияние и Красота', '570.0000', 'Описание отсутствует', 'Товары салона красоты\\6964199-1.jpg', 1, 19),
(38, 'Маска-пленка для глубокого очищения пор', '920.0000', 'Описание отсутствует', 'Товары салона красоты\\6556453-1.jpg', 1, 50),
(39, 'Ирисовый освежающий дневной крем', '740.0000', 'Описание отсутствует', 'Товары салона красоты\\1781693-1.jpg', 1, 33),
(40, 'Деликатный увлажняющий крем', '940.0000', 'Описание отсутствует', 'Товары салона красоты\\1781680-1.jpg', 1, 33),
(41, 'Ухаживающее масло, против сухости кожи', '410.0000', 'Описание отсутствует', 'Товары салона красоты\\6953160-1.jpg', 1, 19),
(42, 'Розовое растительное мыло', '470.0000', 'Описание отсутствует', 'Товары салона красоты\\1781711-1.jpg', 1, 33),
(43, 'Гранатовый дневной крем-лифтинг', '800.0000', 'Описание отсутствует', 'Товары салона красоты\\1781695-1.jpg', 1, 33),
(44, 'Тонизирующее очищающее средство 2 в 1', '640.0000', 'Описание отсутствует', 'Товары салона красоты\\2008488-1.jpg', 1, 33),
(45, 'Сыворотка для лица с гиалуроновой кислотой, для сухой и чувствительной кожи', '590.0000', 'Описание отсутствует', 'Товары салона красоты\\9631448-1.jpg', 0, 49),
(46, 'Эфирное масло лимона', '330.0000', 'Описание отсутствует', 'Товары салона красоты\\7064322-1.jpg', 1, 19),
(47, 'Эфирное масло розовое дерево', '510.0000', 'Описание отсутствует', 'Товары салона красоты\\7064326-1.jpg', 0, 19),
(48, 'Мягкая пенка для умывания', '680.0000', 'Описание отсутствует', 'Товары салона красоты\\5625224-1.jpg', 0, 33),
(49, 'Сыворотка для лица с гиалуроновой кислотой, для нормальной кожи', '560.0000', 'Описание отсутствует', 'Товары салона красоты\\9631445-1.jpg', 1, 49),
(50, 'Тоник для лица, для жирной и проблемной кожи', '600.0000', 'Описание отсутствует', 'Товары салона красоты\\9631442-1.jpg', 1, 49),
(51, 'Пенка для умывания, для сухой и чувствительной кожи', '440.0000', 'Описание отсутствует', 'Товары салона красоты\\9631439-1.jpg', 1, 49),
(52, 'Антивозрастной крем для лица с органическими ягодами годжи', '990.0000', 'Описание отсутствует', 'Товары салона красоты\\6433981-1.jpg', 0, 9),
(53, 'Эфирное масло эвкалипт', '410.0000', 'Описание отсутствует', 'Товары салона красоты\\7064320-1.jpg', 1, 19),
(54, 'Сыворотка PERFECT SERUM депигментирующая натуральная', '710.0000', 'Описание отсутствует', 'Товары салона красоты\\9939719-1.jpg', 1, 10),
(55, 'Крем для лица с антиоксидантами органической клюквы', '980.0000', 'Описание отсутствует', 'Товары салона красоты\\6433979-1.jpg', 0, 9),
(56, 'Пенка для лица для чувствительной кожи', '630.0000', 'Описание отсутствует', 'Товары салона красоты\\3472601-1.jpg', 1, 6),
(57, 'Коллекция Кокосовая, Укрепляющая сыворотка с экстрактами кактуса', '680.0000', 'Описание отсутствует', 'Товары салона красоты\\3472604-1.jpg', 1, 6),
(58, 'Крем-маска WOW EFFECT омолаживающая для лица натуральная', '950.0000', 'Описание отсутствует', 'Товары салона красоты\\9939704-1.jpg', 1, 10),
(59, 'Подарочный набор For MEN', '840.0000', 'Описание отсутствует', 'Товары салона красоты\\7299378-1.jpg', 1, 19),
(60, 'Очищающий гель для нормальной и сухой кожи лица', '720.0000', 'Описание отсутствует', 'Товары салона красоты\\6556458-1.jpg', 1, 50),
(61, 'Лифтинг-сыворотка для лица', '930.0000', 'Описание отсутствует', 'Товары салона красоты\\6556462-1.jpg', 0, 50),
(62, 'Тоник для ухода за сухой и нормальной кожей', '990.0000', 'Описание отсутствует', 'Товары салона красоты\\6556459-1.jpg', 1, 50),
(63, 'Питательный крем для лица', '800.0000', 'Описание отсутствует', 'Товары салона красоты\\6556464-1.jpg', 0, 50),
(64, 'Крем против морщин для глаз', '570.0000', 'Описание отсутствует', 'Товары салона красоты\\5427580-1.jpg', 0, 46),
(65, 'Лифтинг-сыворотка для лица с гиалуроновой кислотой', '610.0000', 'Описание отсутствует', 'Товары салона красоты\\9631446-1.jpg', 1, 49),
(66, 'Деликатное питательное масло для лица', '930.0000', 'Описание отсутствует', 'Товары салона красоты\\2262226-1.jpg', 1, 33),
(67, 'Тонизирующая сыворотка для лица', '780.0000', 'Описание отсутствует', 'Товары салона красоты\\6556461-1.jpg', 1, 50),
(68, 'Масло праймер для лица (основа под макияж), Выравнивание', '530.0000', 'Описание отсутствует', 'Товары салона красоты\\6953159-1.jpg', 1, 19),
(69, 'Сыворотка COUPEROSE укрепляющая сосуды натуральная', '590.0000', 'Описание отсутствует', 'Товары салона красоты\\9939714-1.jpg', 1, 10),
(70, 'Органический тонер с экстрактом Розы', '960.0000', 'Описание отсутствует', 'Товары салона красоты\\7889950-1.jpg', 1, 9),
(71, 'Пенка для умывания, для жирной и комбинированной кожи', '780.0000', 'Описание отсутствует', 'Товары салона красоты\\9631437-1.jpg', 1, 49),
(72, 'Маска для лица увлажняющая и тонизирующая', '860.0000', 'Описание отсутствует', 'Товары салона красоты\\6556451-1.jpg', 1, 50),
(73, 'Эфирное масло чайного дерева', '410.0000', 'Описание отсутствует', 'Товары салона красоты\\7064334-1.jpg', 1, 19),
(74, 'Очищающий гель для комбинированной и жирной кожи лица', '980.0000', 'Описание отсутствует', 'Товары салона красоты\\6556457-1.jpg', 1, 50),
(75, 'Масло после бритья Натуральное, Лимон и Корица', '300.0000', 'Описание отсутствует', 'Товары салона красоты\\7528031-1.jpg', 1, 19),
(76, 'Ухаживающее масло для лица, восстанавливает кожу', '420.0000', 'Описание отсутствует', 'Товары салона красоты\\6953176-1.jpg', 1, 19),
(77, 'Подарочный набор Мягкое Очищение', '850.0000', 'Описание отсутствует', 'Товары салона красоты\\6964195-1.jpg', 1, 19),
(78, 'Гранатовый ночной крем-лифтинг', '560.0000', 'Описание отсутствует', 'Товары салона красоты\\1781696-1.jpg', 1, 33),
(79, 'Живительный тоник для лица', '770.0000', 'Описание отсутствует', 'Товары салона красоты\\2008486-1.jpg', 0, 33),
(80, 'Универсальный питательный крем SKIN FOOD', '640.0000', 'Описание отсутствует', 'Товары салона красоты\\2351755-1.jpg', 1, 33),
(81, 'Органическое 100% аргановое масло', '760.0000', 'Описание отсутствует', 'Товары салона красоты\\6433982-1.jpg', 1, 9),
(82, 'Пенка для умывания, для нормальной кожи', '400.0000', 'Описание отсутствует', 'Товары салона красоты\\9631438-1.jpg', 1, 49),
(83, 'Крем PERFECT выравнивающий тон лица натуральный', '780.0000', 'Описание отсутствует', 'Товары салона красоты\\9939700-1.jpg', 1, 10),
(84, 'Чистящая пена-гель для лица', '550.0000', 'Описание отсутствует', 'Товары салона красоты\\2697586-1.jpg', 1, 46),
(85, 'Пенка для умывания Натуральная, Лимон и корица', '280.0000', 'Описание отсутствует', 'Товары салона красоты\\7528032-1.jpg', 1, 19),
(86, 'Масло для лица массажное, с эффектом Лифтинга', '500.0000', 'Описание отсутствует', 'Товары салона красоты\\6953169-1.jpg', 0, 19),
(87, 'Увлажняющий 24-часовой крем против морщин', '910.0000', 'Описание отсутствует', 'Товары салона красоты\\2697576-1.jpg', 1, 46),
(88, 'Подарочный набор Travel, в Командировку, мужской', '880.0000', 'Описание отсутствует', 'Товары салона красоты\\7299376-1.jpg', 1, 19),
(89, 'Тоник для ухода за жирной и комбинированной кожей', '800.0000', 'Описание отсутствует', 'Товары салона красоты\\6556460-1.jpg', 1, 50),
(90, 'Тонизирующий крем для лица', '800.0000', 'Описание отсутствует', 'Товары салона красоты\\6556465-1.jpg', 1, 50),
(91, 'Восстанавливающий крем для лица с органическим шиповником', '960.0000', 'Описание отсутствует', 'Товары салона красоты\\6433984-1.jpg', 1, 9),
(92, 'Эфирное масло перечной мяты', '390.0000', 'Описание отсутствует', 'Товары салона красоты\\7064324-1.jpg', 0, 19),
(93, 'Тоник для лица, Успокаивающий, для всех типов кожи', '410.0000', 'Описание отсутствует', 'Товары салона красоты\\6953158-1.jpg', 1, 19),
(94, 'Эфирное масло бергамота', '380.0000', 'Описание отсутствует', 'Товары салона красоты\\7064315-1.jpg', 1, 19),
(95, 'Гималайская грязевая маска восстанавливающая', '640.0000', 'Описание отсутствует', 'Товары салона красоты\\6556455-1.jpg', 1, 50),
(96, 'Эфирное масло лаванды', '570.0000', 'Описание отсутствует', 'Товары салона красоты\\7064314-1.jpg', 1, 19),
(97, 'Гималайская грязевая маска антиоксидантная', '660.0000', 'Описание отсутствует', 'Товары салона красоты\\6556454-1.jpg', 1, 50),
(98, 'Гранатовая интенсивная сыворотка-лифтинг', '720.0000', 'Описание отсутствует', 'Товары салона красоты\\1781670-1.jpg', 1, 33),
(99, 'Коллекция Кокосовая, Увлажняющий ночной крем с экстрактами кактуса', '700.0000', 'Описание отсутствует', 'Товары салона красоты\\3472608-1.jpg', 1, 6),
(100, 'Тоник-пилинг для лица EXFOLIANT на основе фруктовых кислот натуральный', '660.0000', 'Описание отсутствует', 'Товары салона красоты\\9939710-1.jpg', 1, 10);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `Product`
--
ALTER TABLE `Product`
  ADD PRIMARY KEY (`ID`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `Product`
--
ALTER TABLE `Product`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=129;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `Product`
--
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
